//ЗАДАНИЕ
//Написать программу, которая запрашивает у пользователя исходные данные, выполняет указанные расчёты и печатает результат на экране.
//Известна длина стороны куба. Вычислить площадь боковой поверхности куба.
//Что пользователь вводит? Длина стороны куба (целое число)
//Площадь боковой поверхности куба (целое число)


using Tyuiu.AjtkuzhinovEE.Sprint1.Task2.V5.Lib;


internal class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                         *");
        Console.WriteLine("***************************************************************************");

        int x;

        Console.WriteLine("Введите значение Х:");
        x = Convert.ToInt32(Console.ReadLine());

        Console.WriteLine("***************************************************************************");
        Console.WriteLine(" РЕЗУЛЬТАТ:                                                                ");
        Console.WriteLine("***************************************************************************");

        Console.WriteLine("площадь боковой поверхности куба = " + ds.CalculateSideSquare(x));
        Console.ReadLine();
    }
}